---
kind: method
id: M:Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray4d.SetValueAsColor(Autodesk.Revit.DB.Color)
source: html/109eb19b-d2db-f398-e603-5a915255c5f8.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray4d.SetValueAsColor Method

Sets the value property as a color.

## Syntax (C#)
```csharp
public void SetValueAsColor(
	Color color
)
```

## Parameters
- **color** (`Autodesk.Revit.DB.Color`) - The new color.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - The input value is invalid for this AssetPropertyDoubleArray4d property.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The asset property is not editable.